-- +goose Up
INSERT INTO events (id, name, dates, profiles, event_type, previous_event_id, subject, additional_info) VALUES
-- RegionalStage
-- ('55555555-5555-5555-5555-555555555551', 'Региональный этап по Астраханской области', null, null, 'REGIONAL_STAGE', NULL, NULL, ''),

-- Olympiad
('55555555-5555-5555-5555-555555555561', 'Предмет Информатика', ARRAY ['05.12.2025', '06.12.2025'], ARRAY ['Программирование' ], 'OLYMPIAD', NUll, 5, ''),
('55555555-5555-5555-5555-555555555562', 'Предмет Математика', ARRAY ['09.12.2025'], NULL, 'OLYMPIAD', NUll, 7, ''),
('55555555-5555-5555-5555-555555555563', 'Предмет История', ARRAY ['11.12.2025'], NULL, 'OLYMPIAD', NUll, 1, ''),
('55555555-5555-5555-5555-555555555564', 'Предмет Русский язык', ARRAY ['13.12.2025'], NULL, 'OLYMPIAD', NUll, 9, ''),
('55555555-5555-5555-5555-555555555565', 'Предмет Биология', ARRAY ['13.12.2025'], NULL, 'OLYMPIAD', NUll, 2, '');


-- +goose Down
DELETE FROM events
WHERE id IN (
    '55555555-5555-5555-5555-555555555561',
    '55555555-5555-5555-5555-555555555562',
    '55555555-5555-5555-5555-555555555563',
    '55555555-5555-5555-5555-555555555564',
    '55555555-5555-5555-5555-555555555565' -- ← новый ID для биологии
);